# Width Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageInstance..::..Width Property
ImageInstance Class See Also
---
The width of the ImageInstance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public double Width { get; set; }
```

Visual Basic
---
```text
Public Property Width As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Width {
	double get ();
	void set (double value);
}
```

# Remarks
If LockProportions is true, then changes to the Width will also result in changes to the Height.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for width results in a height that is more than 30000 feet because LockProportions is set to true. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for width must be between 0 and 30000 feet. |

# See Also
ImageInstance Class
Autodesk.Revit.DB Namespace